[
  {
    "position": "Junior Python Developer",
    "company": "GradXpert",
    "location": "Greater Delhi Area",
    "date": "2025-07-12",
    "salary": "Not specified",
    "jobUrl": "https://in.linkedin.com/jobs/view/junior-python-developer-at-gradxpert-4265679422?refId=RhqrxoYnhkn3iAlZZVgMOg%3D%3D&trackingId=X1j%2F%2BNB9t0d%2Fw%2BLXa9VAIQ%3D%3D&position=1&pageNum=0",
    "companyLogo": "https://media.licdn.com/dms/image/v2/D560BAQFScKoYaxdoUg/company-logo_100_100/company-logo_100_100/0/1737107649135/gradxpert_logo?e=1755734400&v=beta&t=R__U1cR2hClxcXY7lS4_Cj9mfoX1aisiUtmu4xE6scA",
    "agoTime": "5 days ago",
    "job_description": "Job Title: Python DeveloperExperience: 1 – 3 YearsLocation: Delhi (Work From Home)Shift Timings: Regular Shift: 10:00 AM – 6:00 PMWe are hiring a Python Developer who involves developing and maintaining risk analytics tools and automating reporting processes to support commodity risk management.Key Responsibilities:Develop, test, and maintain Python scripts for data analysis and reportingWrite scalable, clean code using Pandas, NumPy, Matplotlib, and OOPS principlesCollaborate with risk analysts to implement process improvementsDocument workflows and maintain SOPs in ConfluenceOptimize code performance and adapt to evolving business needsRequirements:Strong hands-on experience with Python, Pandas, NumPy, Matplotlib, and OOPSGood understanding of data structures and algorithmsExperience with Excel and VBA is an added advantageExposure to financial/market risk environments is preferredExcellent problem-solving, communication, and documentation skills\n        \n\n        \n\n    \n    \n    \n\n    \n\n        \n            Show more\n          \n\n          \n    \n  \n\n        \n\n    \n    \n    \n\n    \n\n        \n            Show less"
  },
  {
    "position": "Java - Backend Developer (Spring boot & Micro Services)",
    "company": "Simeio",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-17",
    "salary": "Not specified",
    "jobUrl": "https://in.linkedin.com/jobs/view/java-backend-developer-spring-boot-micro-services-at-simeio-4176949334?refId=RhqrxoYnhkn3iAlZZVgMOg%3D%3D&trackingId=Jm%2Bo9EmfJnAg9bixNOIyRw%3D%3D&position=2&pageNum=0",
    "companyLogo": "https://media.licdn.com/dms/image/v2/D4E0BAQHEqGjpeSiW9w/company-logo_100_100/company-logo_100_100/0/1726697579608/identitywithsimeio_logo?e=1755734400&v=beta&t=CyoOl7s3nsO6ZXtMDBt9NauzOT17eHIldtD6qx4lBXg",
    "agoTime": "",
    "job_description": "Simeio is a global identity and access management service provider focused on protecting organizations key data and access requirements to business critical systems and applications.Simeio provides services such as Access Management, IGA, PAM & CIAM plus our wider service offerings include support, upgrades, governance and application onboarding.The OpportunityAn Java & Spring boot developer experience in our team is a crucial part of Simeio.This role will let you work on some of our biggest and most interesting projects with clients from across the globe.You’ll also work in parallel with other tool as part of a team on larger implementations or application onboarding projects.This is an excellent opportunity to use your existing skills and continue to develop yourself by learning from other highly skilled industry professionals.The RoleStrong Java and spring boot developer with background in Java 8/21, and extensive experience with Spring Boot. Responsible for developing and maintaining high-performance applications, ensuring security and scalability.Responsibilities Design, develop, and maintain applications using Spring Boot and Java 8/21. Leveraging core spring boot for building customized APIs. Collaborate with cross-functional teams to define, design, and ship new features. Ensure the performance, quality, and responsiveness of applications. Identify and correct bottlenecks and fix bugs.Key Skills Strong proficiency in Java 8/21. Hands-on experience with Spring Boot framework. Experience with RESTful APIs and web services. Familiarity with front-end technologies (e.g., Angular) is a plus. Knowledge of database systems and SQL or MySQL. Basic understanding of DevOps practices, including Docker and Kubernetes. Strong problem-solving skills and attention to detail. Excellent communication and teamwork skills.Desirable Skills Experience with microservices architecture. Familiarity with cloud platforms, preferably AWS. Understanding of security best practices in application development. Experience with Kubernetes, preferably in EKS on AWS.About SimeioSimeio has over 650 talented employees across the globe. We have offices in USA (Atlanta HQ and Texas), India, Canada, Costa Rica and UK.Founded in 2007, and now backed by private equity company ZMC, Simeio is recognized as a top IAM provider by industry analysts.Alongside Simeio’s identity orchestration tool ‘Simeio IO’ - Simeio also partners with industry leading IAM software vendors to provide access management, identity governance and administration, privileged access management and risk intelligence services across on-premise, cloud, and hybrid technology environments.Simeio provides services to numerous Fortune 1000 companies across all industries including financial services, technology, healthcare, media, retail, public sector, utilities and education.Simeio is an equal opportunity employer. If you require assistance with completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please direct your inquiries to our recruitment team - [email protected].Thank youAbout Your ApplicationWe review every application received and will get in touch if your skills and experience match what we’re looking for. If you don’t hear back from us within 10 days, please don’t be too disappointed – we may keep your CV on our database for any future vacancies and we would encourage you to keep an eye on our career opportunities as there may be other suitable roles.Simeio is an equal opportunity employer. If you require assistance with completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please direct your inquiries to any of the recruitment team at recruitment@simeio.com or +1 404-882-3700.\n        \n\n        \n\n    \n    \n    \n\n    \n\n        \n            Show more\n          \n\n          \n    \n  \n\n        \n\n    \n    \n    \n\n    \n\n        \n            Show less"
  }
]